#language: ru

@tree

Функционал: <описание фичи>

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: <описание сценария>
* Подготовка тестовых данных

И Загружаю константы
И Загружаю организацию
И Создание объектов для плана видов характеристик ВидыХарактеристик с ОбменДанными.Загрузка = Истина
и Загрузка поставщиков
И Создание документа Поступление товаров
и Сценарий Проверка наличия номенклатуры Торт

